In [17]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'Class1': [95, 92, 98, 100], 
                    'Class2': [91, 93, 97, 99]})

df2 = pd.DataFrame({'Class1': [87, 89], 
                    'Class2': [85, 90]})

df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [18]:
df1.append(df2, True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [26]:
index_label = ['a','b','c','d']
dfa = pd.DataFrame({'Class1': [95, 92, 98, 100], 
                    'Class2': [91, 93, 97, 99]}, index= index_label)

dfb = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

dfa.join(dfb)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [65]:
df_A_B = pd.DataFrame({
    '판매월': ['1월', '2월', '3월', '4월'],
    '제품A': [100, 150, 200, 130],
    '제품B': [90, 110, 140, 170]})

df_C_D = pd.DataFrame({
    '판매월': ['1월', '2월', '3월', '4월'],
    '제품C': [112, 141, 203, 134],
    '제품D': [90, 110, 140, 170]})

df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [69]:
%%writefile sea_rain1.csv

연도,동해,남해,서해,전체
1996,15,16,17,18
1997,13,14,15,16
1998,17,16,15,14
1999,18,18,17,17

Writing sea_rain1.csv

In [77]:
data = pd.read_csv('sea_rain1.csv')
print(data)

     연도  동해  남해  서해  전체
0  1996  15  16  17  18
1  1997  13  14  15  16
2  1998  17  16  15  14
3  1999  18  18  17  17

In [84]:
data.to_csv('sea_rain3.csv')

data = pd.read_csv('sea_rain3.csv')
print(data)

   Unnamed: 0    연도  동해  남해  서해  전체
0           0  1996  15  16  17  18
1           1  1997  13  14  15  16
2           2  1998  17  16  15  14
3           3  1999  18  18  17  17

In [83]:
data = pd.read_csv('sea_rain2.csv', encoding="cp949")
print(data)

     연도  동해  남해  서해  전체
0  1996  15  16  17  18
1  1997  13  14  15  16
2  1998  17  16  15  14
3  1999  18  18  17  17